-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/mauricio/Documents/projects/ra/roth/honestDiD/stata-honestdi
> d/test/unit-tests-consistency.do.log
  log type:  text
 opened on:  25 Jan 2024, 18:27:35

. set rmsg on
r; t=0.00 18:27:35

. tempname beta sigma
r; t=0.00 18:27:35

. mata {
>     st_matrix(st_local("beta"),  _honestExampleBCBeta())
>     st_matrix(st_local("sigma"), _honestExampleBCSigma())
> }
r; t=0.00 18:27:35

. 
. * Base relative magnitudes comparison
. honestdid, numpre(4) b(`beta') vcov(`sigma')
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.2222 |  0.144 |  0.248 | 
|  0.4444 |  0.124 |  0.266 | 
|  0.6667 |  0.102 |  0.287 | 
|  0.8889 |  0.079 |  0.308 | 
|  1.1111 |  0.056 |  0.329 | 
|  1.3333 |  0.032 |  0.351 | 
|  1.5556 |  0.008 |  0.375 | 
|  1.7778 | -0.016 |  0.399 | 
|  2.0000 | -0.041 |  0.423 | 
(method = C-LF, Delta = DeltaRM, alpha = 0.050)
r; t=8.73 18:27:44

. 
. mata st_matrix("l_vec", _honestBasis(1, 4))
r; t=0.00 18:27:44

. mata st_matrix("l_alt", J(4, 1, 1)/4)
r; t=0.00 18:27:44

. local opts mvec(0(0.5)2) gridPoints(100) grid_lb(-1) grid_ub(1) l_vec(l_vec)
r; t=0.00 18:27:44

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts'
Warning: M = 0 with Delta^RM imposes exact parallel trends in the
post-treatment period, even if pre-treatment parallel trends is violated
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.172 |  0.232 | 
|  0.5000 |  0.131 |  0.253 | 
|  1.0000 |  0.071 |  0.313 | 
|  1.5000 |  0.030 |  0.354 | 
|  2.0000 | -0.030 |  0.414 | 
(method = C-LF, Delta = DeltaRM, alpha = 0.050)
r; t=1.71 18:27:46

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' method(Conditional)
Warning: M = 0 with Delta^RM imposes exact parallel trends in the
post-treatment period, even if pre-treatment parallel trends is violated
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.172 |  0.232 | 
|  0.5000 |  0.131 |  0.253 | 
|  1.0000 |  0.071 |  0.313 | 
|  1.5000 |  0.030 |  0.354 | 
|  2.0000 | -0.030 |  0.414 | 
(method = Conditional, Delta = DeltaRM, alpha = 0.050)
r; t=0.91 18:27:47

. 
. local opts mvec(0(0.5)2) gridPoints(100) grid_lb(-1) grid_ub(1) l_vec(l_alt)
r; t=0.00 18:27:47

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts'
Warning: M = 0 with Delta^RM imposes exact parallel trends in the
post-treatment period, even if pre-treatment parallel trends is violated
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.184 |  0.253 | (Original)
|  0.0000 |  0.192 |  0.253 | 
|  0.5000 |  0.071 |  0.354 | 
|  1.0000 | -0.051 |  0.495 | 
|  1.5000 | -0.192 |  0.636 | 
|  2.0000 | -0.333 |  0.778 | 
(method = C-LF, Delta = DeltaRM, alpha = 0.050)
r; t=1.40 18:27:48

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' method(Conditional)
Warning: M = 0 with Delta^RM imposes exact parallel trends in the
post-treatment period, even if pre-treatment parallel trends is violated
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.184 |  0.253 | (Original)
|  0.0000 |  0.192 |  0.253 | 
|  0.5000 |  0.071 |  0.354 | 
|  1.0000 | -0.051 |  0.495 | 
|  1.5000 | -0.192 |  0.636 | 
|  2.0000 | -0.333 |  0.778 | 
(method = Conditional, Delta = DeltaRM, alpha = 0.050)
r; t=0.43 18:27:48

. 
. * Base non-rm comparison
. honestdid, numpre(4) b(`beta') vcov(`sigma') delta(sd)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.131 |  0.216 | 
|  0.0225 |  0.183 |  0.327 | 
|  0.0449 |  0.174 |  0.363 | 
|  0.0674 |  0.152 |  0.386 | 
|  0.0899 |  0.130 |  0.408 | 
|  0.1123 |  0.107 |  0.431 | 
|  0.1348 |  0.085 |  0.453 | 
|  0.1572 |  0.062 |  0.476 | 
|  0.1797 |  0.040 |  0.498 | 
|  0.2022 |  0.017 |  0.521 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.30 18:27:49

. 
. local opts mvec(0(0.1)0.3) l_vec(l_vec)
r; t=0.00 18:27:49

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(FLCI)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.131 |  0.216 | 
|  0.1000 |  0.119 |  0.419 | 
|  0.2000 |  0.019 |  0.519 | 
|  0.3000 | -0.081 |  0.619 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.18 18:27:49

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(Conditio
> nal)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.210 |  0.328 | 
|  0.1000 |  0.120 |  0.418 | 
|  0.2000 |  0.020 |  0.518 | 
|  0.3000 | -0.080 |  0.618 | 
(method = Conditional, Delta = DeltaSD, alpha = 0.050)
r; t=0.88 18:27:50

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(C-F)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.206 |  0.234 | 
|  0.1000 |  0.119 |  0.419 | 
|  0.2000 |  0.020 |  0.518 | 
|  0.3000 | -0.080 |  0.618 | 
(method = C-F, Delta = DeltaSD, alpha = 0.050)
r; t=0.69 18:27:50

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(C-LF)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.159 |  0.233 | (Original)
|  0.0000 |  0.210 |  0.328 | 
|  0.1000 |  0.120 |  0.419 | 
|  0.2000 |  0.019 |  0.519 | 
|  0.3000 | -0.081 |  0.618 | 
(method = C-LF, Delta = DeltaSD, alpha = 0.050)
r; t=0.73 18:27:51

. 
. local opts mvec(0(0.1)0.3) l_vec(l_alt)
r; t=0.00 18:27:51

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(FLCI)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.184 |  0.253 | (Original)
|  0.0000 |  0.133 |  0.230 | 
|  0.1000 | -0.186 |  0.988 | 
|  0.2000 | -0.686 |  1.488 | 
|  0.3000 | -1.186 |  1.988 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.18 18:27:51

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(Conditio
> nal)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.184 |  0.253 | (Original)
|  0.0000 |  0.297 |  0.353 | (+)
|  0.1000 | -0.185 |  0.853 | (+)
|  0.2000 | -0.684 |  1.353 | (+)
|  0.3000 | -1.185 |  1.853 | (+)
(method = Conditional, Delta = DeltaSD, alpha = 0.050)
(+) CI is open at upper endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=0.32 18:27:52

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(C-F)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.184 |  0.253 | (Original)
|  0.0000 |  0.239 |  0.251 | 
|  0.1000 | -0.186 |  0.988 | 
|  0.2000 | -0.686 |  1.488 | 
|  0.3000 | -1.183 |  1.985 | 
(method = C-F, Delta = DeltaSD, alpha = 0.050)
r; t=0.36 18:27:52

. honestdid, numpre(4) b(`beta') vcov(`sigma') `opts' delta(sd) method(C-LF)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.184 |  0.253 | (Original)
|  0.0000 |  0.299 |  0.353 | (+)
|  0.1000 | -0.185 |  0.853 | (+)
|  0.2000 | -0.687 |  1.353 | (+)
|  0.3000 | -1.185 |  1.853 | (+)
(method = C-LF, Delta = DeltaSD, alpha = 0.050)
(+) CI is open at upper endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=0.57 18:27:53

. 
. * Large non-rm comparison
. * -----------------------
. 
. use test/LWdata_RawData.dta, clear
r; t=0.00 18:27:53

. mata stata(_honestExampleLWCall())
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =  2,071,260
Absorbing 3 HDFE groups                           F(  40,     49) =      48.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5134
                                                  Adj R-squared   =     0.5133
                                                  Within R-sq.    =     0.0240
Number of clusters (BIRTHSTATE) =         50      Root MSE        =     0.0299

                            (Std. Err. adjusted for 50 clusters in BIRTHSTATE)
------------------------------------------------------------------------------
             |               Robust
         emp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     rtESV13 |   .0218326   .0150761     1.45   0.154    -.0084639    .0521292
     rtESV14 |   .0155924   .0163458     0.95   0.345    -.0172557    .0484405
     rtESV15 |    .002349   .0100346     0.23   0.816    -.0178162    .0225143
     rtESV16 |    .009295   .0080027     1.16   0.251     -.006787    .0253769
     rtESV17 |   .0080775   .0046505     1.74   0.089    -.0012679     .017423
     rtESV18 |   .0096308   .0051837     1.86   0.069    -.0007862    .0200478
     rtESV19 |   .0014553   .0043947     0.33   0.742    -.0073762    .0102868
    rtESV110 |  -.0034589   .0051169    -0.68   0.502    -.0137418     .006824
    rtESV111 |  -.0046198   .0020348    -2.27   0.028     -.008709   -.0005307
    rtESV113 |  -.0047816   .0038844    -1.23   0.224    -.0125876    .0030244
    rtESV114 |   -.009562   .0045469    -2.10   0.041    -.0186994   -.0004246
    rtESV115 |  -.0136362   .0040365    -3.38   0.001     -.021748   -.0055245
    rtESV116 |  -.0131881   .0048604    -2.71   0.009    -.0229554   -.0034208
    rtESV117 |  -.0117635   .0050816    -2.31   0.025    -.0219754   -.0015517
    rtESV118 |  -.0140831   .0051842    -2.72   0.009    -.0245011   -.0036652
    rtESV119 |  -.0085938   .0051869    -1.66   0.104    -.0190174    .0018298
    rtESV120 |  -.0124379   .0057466    -2.16   0.035    -.0239862   -.0008895
    rtESV121 |   -.013811   .0049909    -2.77   0.008    -.0238405   -.0037814
    rtESV122 |   -.013069   .0054242    -2.41   0.020    -.0239693   -.0021686
    rtESV123 |  -.0152452   .0054238    -2.81   0.007    -.0261448   -.0043456
    rtESV124 |  -.0162461   .0052979    -3.07   0.004    -.0268926   -.0055995
    rtESV125 |  -.0171394   .0056009    -3.06   0.004    -.0283949   -.0058839
    rtESV126 |  -.0249014   .0062585    -3.98   0.000    -.0374783   -.0123246
    rtESV127 |  -.0242801   .0062522    -3.88   0.000    -.0368443   -.0117158
    rtESV128 |  -.0246493   .0071115    -3.47   0.001    -.0389404   -.0103582
    rtESV129 |  -.0315922   .0062608    -5.05   0.000    -.0441737   -.0190108
    rtESV130 |  -.0296503   .0066966    -4.43   0.000    -.0431077   -.0161929
    rtESV131 |  -.0326207   .0071235    -4.58   0.000    -.0469358   -.0183055
    rtESV132 |  -.0331873   .0074197    -4.47   0.000    -.0480978   -.0182769
    rtESV133 |  -.0327007   .0079775    -4.10   0.000    -.0487321   -.0166693
    rtESV134 |  -.0312616   .0091758    -3.41   0.001     -.049701   -.0128222
    rtESV135 |  -.0354356   .0091431    -3.88   0.000    -.0538093    -.017062
   yearsfcor |  -.0014109   .0003749    -3.76   0.000    -.0021642   -.0006576
    yearsflr |  -.0003817   .0004227    -0.90   0.371    -.0012312    .0004678
      aveitc |   .0435799   .0199526     2.18   0.034     .0034836    .0836762
   fscontrol |  -.1424124    .083087    -1.71   0.093     -.309382    .0245573
       asian |   .1729234   .0504397     3.43   0.001      .071561    .2742857
       black |  -.0289535   .0202055    -1.43   0.158     -.069558    .0116509
    hispanic |    .010012   .0298186     0.34   0.738    -.0499107    .0699347
       other |  -.1014796   .0319118    -3.18   0.003    -.1656087   -.0373505
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------------+
                 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------------+---------------------------------------|
             PUS_SURVEY_YEAR |         8           1           7     |
                  BIRTHSTATE |        50          50           0    *|
   PUS_SURVEY_YEAR#BIRTHYEAR |       120           8         112     |
---------------------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
r; t=0.34 18:27:53

. matrix b = 100 * e(b)
r; t=0.00 18:27:53

. matrix V = 100^2 * e(V) * 1.038349
r; t=0.00 18:27:53

. mata st_matrix("l_vec", _honestBasis(15 - (-2), 23))
r; t=0.00 18:27:53

. mata st_matrix("l_alt", J(23, 1, 1)/23)
r; t=0.00 18:27:53

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) delta(sd)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -1.254 |  0.298 | (Original)
|  0.0000 |  0.796 |  1.763 | 
|  0.4432 | -2.253 |  0.193 | 
|  0.8863 | -2.678 |  0.759 | 
|  1.3295 | -3.107 |  1.227 | 
|  1.7726 | -3.551 |  1.670 | 
|  2.2158 | -3.994 |  2.113 | 
|  2.6590 | -4.437 |  2.557 | 
|  3.1021 | -4.880 |  3.000 | 
|  3.5453 | -5.323 |  3.443 | 
|  3.9884 | -5.766 |  3.886 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.40 18:27:53

. 
. local opts delta(sd) mvec(0(0.005)0.04) l_vec(l_vec)
r; t=0.00 18:27:53

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(FLCI)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -4.410 | -1.909 | (Original)
|  0.0000 |  3.910 |  8.374 | 
|  0.0050 |  2.124 |  8.178 | 
|  0.0100 | -0.083 |  8.194 | 
|  0.0150 | -2.382 |  8.036 | 
|  0.0200 | -4.942 |  7.514 | 
|  0.0250 | -8.120 |  6.236 | 
|  0.0300 | -10.555 |  5.558 | 
|  0.0350 | -12.772 |  5.047 | 
|  0.0400 | -14.104 |  5.390 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.55 18:27:54

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(Conditional)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -4.410 | -1.909 | (Original)
|  0.0000 | -12.759 | -3.947 | (-)
|  0.0050 | -13.524 | -3.371 | (-)
|  0.0100 | -14.289 | -2.761 | (-)
|  0.0150 | -15.054 | -2.125 | (-)
|  0.0200 | -15.819 | -1.473 | (-)
|  0.0250 | -16.584 | -0.813 | (-)
|  0.0300 | -17.349 | -0.156 | (-)
|  0.0350 | -18.114 |  0.562 | (-)
|  0.0400 | -18.879 |  1.266 | (-)
(method = Conditional, Delta = DeltaSD, alpha = 0.050)
(-) CI is open at lower endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=10.09 18:28:04

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(C-F)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -4.410 | -1.909 | (Original)
|  0.0000 |  2.952 |  3.233 | 
|  0.0050 |  1.418 |  1.811 | 
|  0.0100 | -0.374 |  0.202 | 
|  0.0150 | -2.173 | -1.234 | 
|  0.0200 | -4.003 | -1.300 | 
|  0.0250 | -5.894 | -0.636 | 
|  0.0300 | -7.892 |  0.031 | 
|  0.0350 | -10.082 |  0.732 | 
|  0.0400 | -12.632 |  1.419 | 
(method = C-F, Delta = DeltaSD, alpha = 0.050)
r; t=10.42 18:28:14

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(C-LF)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -4.410 | -1.909 | (Original)
|  0.0000 | -12.759 | -3.895 | (-)
|  0.0050 | -13.524 | -3.290 | (-)
|  0.0100 | -14.289 | -2.675 | (-)
|  0.0150 | -15.054 | -2.034 | (-)
|  0.0200 | -15.819 | -1.378 | (-)
|  0.0250 | -16.584 | -0.714 | (-)
|  0.0300 | -17.349 | -0.052 | (-)
|  0.0350 | -18.114 |  0.671 | (-)
|  0.0400 | -18.879 |  1.342 | (-)
(method = C-LF, Delta = DeltaSD, alpha = 0.050)
(-) CI is open at lower endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=7.71 18:28:22

. 
. local opts delta(sd) mvec(0(0.005)0.04) l_vec(l_alt)
r; t=0.00 18:28:22

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(FLCI)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -3.047 | -0.987 | (Original)
|  0.0000 |  3.483 |  6.909 | 
|  0.0050 |  2.232 |  6.692 | 
|  0.0100 |  0.620 |  6.595 | 
|  0.0150 | -1.051 |  6.378 | 
|  0.0200 | -2.921 |  5.884 | 
|  0.0250 | -5.266 |  4.808 | 
|  0.0300 | -7.024 |  4.211 | 
|  0.0350 | -8.525 |  3.832 | 
|  0.0400 | -9.610 |  3.851 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.43 18:28:23

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(Conditional)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -3.047 | -0.987 | (Original)
|  0.0000 | -10.510 | -2.388 | (-)
|  0.0050 | -11.010 | -2.017 | (-)
|  0.0100 | -11.510 | -1.601 | (-)
|  0.0150 | -12.010 | -1.214 | (-)
|  0.0200 | -12.510 | -0.789 | (-)
|  0.0250 | -13.010 | -0.352 | (-)
|  0.0300 | -13.510 |  0.068 | (-)
|  0.0350 | -14.010 |  0.519 | (-)
|  0.0400 | -14.510 |  0.973 | (-)
(method = Conditional, Delta = DeltaSD, alpha = 0.050)
(-) CI is open at lower endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=4.27 18:28:27

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(C-F)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -3.047 | -0.987 | (Original)
|  0.0000 |  2.747 |  2.973 | 
|  0.0050 |  1.678 |  1.983 | 
|  0.0100 |  0.396 |  0.832 | 
|  0.0150 | -0.891 | -0.212 | 
|  0.0200 | -2.212 | -0.658 | 
|  0.0250 | -3.570 | -0.238 | 
|  0.0300 | -5.011 |  0.207 | 
|  0.0350 | -6.599 |  0.649 | 
|  0.0400 | -8.463 |  1.102 | 
(method = C-F, Delta = DeltaSD, alpha = 0.050)
r; t=4.39 18:28:31

. honestdid, pre(1/9) post(10/32) b(b) vcov(V) `opts' method(C-LF)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . | -3.047 | -0.987 | (Original)
|  0.0000 | -10.510 | -2.367 | (-)
|  0.0050 | -11.010 | -1.973 | (-)
|  0.0100 | -11.510 | -1.578 | (-)
|  0.0150 | -12.010 | -1.166 | (-)
|  0.0200 | -12.510 | -0.739 | (-)
|  0.0250 | -13.010 | -0.300 | (-)
|  0.0300 | -13.510 |  0.149 | (-)
|  0.0350 | -14.010 |  0.575 | (-)
|  0.0400 | -14.510 |  1.031 | (-)
(method = C-LF, Delta = DeltaSD, alpha = 0.050)
(-) CI is open at lower endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=6.32 18:28:38

. 
. * One post-period
. * ---------------
. 
. local opts mvec(0(0.1)0.3) delta(sd) numpre(7)
r; t=0.00 18:28:38

. honestdid, b(`beta') vcov(`sigma') `opts' method(FLCI)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.072 |  0.180 | (Original)
|  0.0000 | -0.182 | -0.106 | 
|  0.1000 |  0.192 |  0.539 | 
|  0.2000 |  0.092 |  0.639 | 
|  0.3000 | -0.008 |  0.739 | 
(method = FLCI, Delta = DeltaSD, alpha = 0.050)
r; t=0.26 18:28:38

. honestdid, b(`beta') vcov(`sigma') `opts' method(Conditional)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.072 |  0.180 | (Original)
|  0.0000 |  0.080 |  0.130 | 
|  0.1000 |  0.100 |  0.623 | 
|  0.2000 |  0.079 |  0.659 | 
|  0.3000 | -0.008 |  0.741 | 
(method = Conditional, Delta = DeltaSD, alpha = 0.050)
r; t=0.26 18:28:38

. honestdid, b(`beta') vcov(`sigma') `opts' method(C-F)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.072 |  0.180 | (Original)
|  0.0000 | -0.092 | -0.090 | (+)
|  0.1000 |  0.150 |  0.581 | (-)
|  0.2000 |  0.081 |  0.656 | 
|  0.3000 | -0.008 |  0.741 | 
(method = C-F, Delta = DeltaSD, alpha = 0.050)
(-) CI is open at lower endpoint; CI length may not be accurate.
(+) CI is open at upper endpoint; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=0.30 18:28:38

. honestdid, b(`beta') vcov(`sigma') `opts' method(C-LF)
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.072 |  0.180 | (Original)
|  0.0000 |      . |      . | (*)
|  0.1000 |  0.117 |  0.614 | 
|  0.2000 |  0.078 |  0.662 | 
|  0.3000 | -0.009 |  0.743 | 
(method = C-LF, Delta = DeltaSD, alpha = 0.050)
(*) CI is open at both endpoints; CI length may not be accurate.
Try expanding the grid using the grid_lb() and grid_ub() options
r; t=0.20 18:28:39

. 
. local opts mvec(0(0.5)2) delta(rm) numpre(7)
r; t=0.00 18:28:39

. honestdid, b(`beta') vcov(`sigma') `opts' method(Conditional)
Warning: M = 0 with Delta^RM imposes exact parallel trends in the
post-treatment period, even if pre-treatment parallel trends is violated
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.072 |  0.180 | (Original)
|  0.0000 |  0.072 |  0.180 | 
|  0.5000 | -0.029 |  0.304 | 
|  1.0000 | -0.149 |  0.439 | 
|  1.5000 | -0.276 |  0.574 | 
|  2.0000 | -0.410 |  0.711 | 
(method = Conditional, Delta = DeltaRM, alpha = 0.050)
r; t=0.41 18:28:39

. honestdid, b(`beta') vcov(`sigma') `opts' method(C-LF)
Warning: M = 0 with Delta^RM imposes exact parallel trends in the
post-treatment period, even if pre-treatment parallel trends is violated
(note: running execution using -parallel-; see help parallel for details)

|    M    |   lb   |   ub   |
| ------- | ------ | ------ |
|       . |  0.072 |  0.180 | (Original)
|  0.0000 |  0.071 |  0.181 | 
|  0.5000 | -0.031 |  0.306 | 
|  1.0000 | -0.150 |  0.441 | 
|  1.5000 | -0.278 |  0.578 | 
|  2.0000 | -0.410 |  0.713 | 
(method = C-LF, Delta = DeltaRM, alpha = 0.050)
r; t=0.54 18:28:39

. 
end of do-file
r; t=0.00 18:28:39
